Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_dma.h
#define DMA_CFGR_FTIE_Pos (2U)
#define DMA_CFGR_FTIE_Msk (0x1U << DMA_CFGR_FTIE_Pos)
#define DMA_CFGR_FTIE DMA_CFGR_FTIE_Msk

#define DMA_CFGR_HTIE_Pos (1U)
#define DMA_CFGR_HTIE_Msk (0x1U << DMA_CFGR_HTIE_Pos)
#define DMA_CFGR_HTIE DMA_CFGR_HTIE_Msk

#define DMA_CFGR_DIR_Pos (0U)
#define DMA_CFGR_DIR_Msk (0x1U << DMA_CFGR_DIR_Pos)
#define DMA_CFGR_DIR DMA_CFGR_DIR_Msk

#define DMA_CH7FLSAD_DFLS_Pos (31U)
#define DMA_CH7FLSAD_DFLS_Msk (0x1U << DMA_CH7FLSAD_DFLS_Pos)
#define DMA_CH7FLSAD_DFLS DMA_CH7FLSAD_DFLS_Msk

#define DMA_CH7CR_PRI_Pos (12U)
#define DMA_CH7CR_PRI_Msk (0x3U << DMA_CH7CR_PRI_Pos)
#define DMA_CH7CR_PRI DMA_CH7CR_PRI_Msk

#define DMA_CH7CR_DIR_Pos (10U)
#define DMA_CH7CR_DIR_Msk (0x1UL << DMA_CH7CR_DIR_Pos)
#define DMA_CH7CR_DIR DMA_CH7CR_DIR_Msk

#define DMA_CH7CR_RINC_Pos (9U)
#define DMA_CH7CR_RINC_Msk (0x1U << DMA_CH7CR_RINC_Pos)
#define DMA_CH7CR_RINC DMA_CH7CR_RINC_Msk

#define DMA_CH7CR_FINC_Pos (8U)
#define DMA_CH7CR_FINC_Msk (0x1U << DMA_CH7CR_FINC_Pos)
#define DMA_CH7CR_FINC DMA_CH7CR_FINC_Msk

#define DMA_GCR_ADDRERR_IE_Pos (1U)
#define DMA_GCR_ADDRERR_IE_Msk (0x1U << DMA_GCR_ADDRERR_IE_Pos)
#define DMA_GCR_ADDRERR_IE DMA_GCR_ADDRERR_IE_Msk

#define DMA_GCR_EN_Pos (0U)
#define DMA_GCR_EN_Msk (0x1U << DMA_GCR_EN_Pos)
#define DMA_GCR_EN DMA_GCR_EN_Msk

#define DMA_ISR_ADDRERR_Pos (17U)
#define DMA_ISR_ADDRERR_Msk (0x1U << DMA_ISR_ADDRERR_Pos)
#define DMA_ISR_ADDRERR DMA_ISR_ADDRERR_Msk

#define DMA_ISR_CHFT_Pos (8U)
#define DMA_ISR_CHFT_Msk (0x1U << DMA_ISR_CHFT_Pos)
#define DMA_ISR_CHFT DMA_ISR_CHFT_Msk

#define DMA_ISR_CHHT_Pos (0U)
#define DMA_ISR_CHHT_Msk (0x1U << DMA_ISR_CHHT_Pos)
#define DMA_ISR_CHHT DMA_ISR_CHHT_Msk

#define FL_DMA_CHANNEL_0 (0x0U << 0U)
#define FL_DMA_CHANNEL_1 (0x1U << 0U)
#define FL_DMA_CHANNEL_2 (0x2U << 0U)
#define FL_DMA_CHANNEL_3 (0x3U << 0U)

#define FL_DMA_CHANNEL_7 (0x7U << 0U)

#define FL_DMA_MEMORY_INC_MODE_NOCHANGE (0x0U << DMA_CHCR_MINC_Pos)
#define FL_DMA_MEMORY_INC_MODE_INCREASE (0x1U << DMA_CHCR_MINC_Pos)
#define FL_DMA_MEMORY_INC_MODE_DECREASE (0x2U << DMA_CHCR_MINC_Pos)

#define FL_DMA_PERIPHERAL_INC_MODE_NOCHANGE (0x0U << DMA_CHCR_PINC_Pos)
#define FL_DMA_PERIPHERAL_INC_MODE_INCREASE (0x1U << DMA_CHCR_PINC_Pos)
#define FL_DMA_PERIPHERAL_INC_MODE_DECREASE (0x2U << DMA_CHCR_PINC_Pos)

#define FL_DMA_CHANNEL_SPI0_RX (0x0U)
#define FL_DMA_CHANNEL_SPI1_RX (0x1U)
#define FL_DMA_CHANNEL_SPI2_RX (0x2U)
#define FL_DMA_CHANNEL_SPI0_TX (0x6U)
#define FL_DMA_CHANNEL_SPI1_TX (0x7U)
#define FL_DMA_CHANNEL_SPI2_TX (0x8U)
#define FL_DMA_CHANNEL_UART0_RX (0xcU)
#define FL_DMA_CHANNEL_UART1_RX (0xdU)
#define FL_DMA_CHANNEL_UART2_RX (0xeU)
#define FL_DMA_CHANNEL_UART3_RX (0xfU)
#define FL_DMA_CHANNEL_UART4_RX (0x10U)
#define FL_DMA_CHANNEL_UART5_RX (0x11U)
#define FL_DMA_CHANNEL_UART6_RX (0x12U)
#define FL_DMA_CHANNEL_UART7_RX (0x16U)
#define FL_DMA_CHANNEL_UART0_TX (0x17U)
#define FL_DMA_CHANNEL_UART1_TX (0x18U)
#define FL_DMA_CHANNEL_UART2_TX (0x19U)
#define FL_DMA_CHANNEL_UART3_TX (0x1aU)
#define FL_DMA_CHANNEL_UART4_TX (0x1bU)
#define FL_DMA_CHANNEL_UART5_TX (0x1cU)
#define FL_DMA_CHANNEL_UART6_TX (0x1dU)
#define FL_DMA_CHANNEL_UART7_TX (0x1eU)
#define FL_DMA_CHANNEL_LPUART0_RX (0x22U)
#define FL_DMA_CHANNEL_LPUART0_TX (0x25U)
#define FL_DMA_CHANNEL_CRC (0x33U)
#define FL_DMA_CHANNEL_ATIM0_CH1 (0x35U)
#define FL_DMA_CHANNEL_ATIM0_CH2 (0x36U)
#define FL_DMA_CHANNEL_ATIM0_CH3 (0x37U)
#define FL_DMA_CHANNEL_ATIM0_CH4 (0x38U)
#define FL_DMA_CHANNEL_ATIM0_TRIG (0x39U)
#define FL_DMA_CHANNEL_ATIM0_COM (0x3aU)
#define FL_DMA_CHANNEL_ATIM0_UEV (0x3bU)
#define FL_DMA_CHANNEL_TAU00 (0x50U)
#define FL_DMA_CHANNEL_TAU01 (0x51U)
#define FL_DMA_CHANNEL_TAU02 (0x52U)
#define FL_DMA_CHANNEL_TAU03 (0x53U)
#define FL_DMA_CHANNEL_TAU04 (0x54U)
#define FL_DMA_CHANNEL_TAU05 (0x55U)
#define FL_DMA_CHANNEL_TAU06 (0x56U)
#define FL_DMA_CHANNEL_TAU07 (0x57U)
#define FL_DMA_CHANNEL_TAU10 (0x58U)
#define FL_DMA_CHANNEL_TAU11 (0x59U)
#define FL_DMA_CHANNEL_TAU12 (0x5aU)
#define FL_DMA_CHANNEL_TAU13 (0x5bU)
#define FL_DMA_CHANNEL_TAU14 (0x5cU)
#define FL_DMA_CHANNEL_TAU15 (0x5dU)
#define FL_DMA_CHANNEL_TAU16 (0x5eU)
#define FL_DMA_CHANNEL_TAU17 (0x5fU)
#define FL_DMA_CHANNEL_BSTIM0_TRIG (0x62U)
#define FL_DMA_CHANNEL_LPTIM0_TRIG (0x63U)
#define FL_DMA_CHANNEL_DAC (0x77U)
#define FL_DMA_CHANNEL_SWTRIG (0x7fU)
#define FL_DMA_CHANNEL_MAX (0x80U)

#define FL_DMA_PRIORITY_LOW (0x0U)
#define FL_DMA_PRIORITY_MEDIUM (0x1U)
#define FL_DMA_PRIORITY_HIGH (0x2U)
#define FL_DMA_PRIORITY_VERYHIGH (0x3U)

#define FL_DMA_BANDWIDTH_8B (0x0U << DMA_CFGR_BDW_Pos)
#define FL_DMA_BANDWIDTH_16B (0x1U << DMA_CFGR_BDW_Pos)
#define FL_DMA_BANDWIDTH_32B (0x2U << DMA_CFGR_BDW_Pos)

#define FL_DMA_FLASH_CODE (0x0U << DMA_CH7FLSAD_DFLS_Pos)
#define FL_DMA_FLASH_DATA (0x1U << DMA_CH7FLSAD_DFLS_Pos)

#define FL_DMA_DIR_PERIPHERAL_TO_RAM (0x0U << DMA_CFGR_DIR_Pos)
#define FL_DMA_DIR_RAM_TO_PERIPHERAL (0x1U << DMA_CFGR_DIR_Pos)
#define FL_DMA_DIR_FLASH_TO_RAM (0x1U << DMA_CH7CR_DIR_Pos)
#define FL_DMA_DIR_RAM_TO_FLASH (0x0U << DMA_CH7CR_DIR_Pos)

#define FL_DMA_CH7_RAM_INC_MODE_INCREASE (0x1U << DMA_CH7CR_RINC_Pos)
#define FL_DMA_CH7_RAM_INC_MODE_DECREASE (0x0U << DMA_CH7CR_RINC_Pos)

#define FL_DMA_CH7_FLASH_INC_MODE_INCREASE (0x1U << DMA_CH7CR_FINC_Pos)
#define FL_DMA_CH7_FLASH_INC_MODE_DECREASE (0x0U << DMA_CH7CR_FINC_Pos)

#define FL_DMA_TRIGGER_CHANNEL_0 (0x1U)
#define FL_DMA_TRIGGER_CHANNEL_1 (0x2U)
#define FL_DMA_TRIGGER_CHANNEL_2 (0x4U)
#define FL_DMA_TRIGGER_CHANNEL_3 (0x8U)
#define FL_DMA_TRIGGER_CHANNEL_4 (0x10U)
#define FL_DMA_TRIGGER_CHANNEL_5 (0x20U)
#define FL_DMA_TRIGGER_CHANNEL_6 (0x40U)

  /**
   * @}
   */
  /* Exported functions ---------------------------------------------------------------------------------*/
  /** @defgroup DMA_FL_Exported_Functions DMA Exported Functions
   * @{
   */

  /**
    * @brief    Set channelx RAM address incremental
    * @rmtoll   CHCR    MINC    FL_DMA_SetRamIncrementMode

    * @param    DMAx DMA instance
    * @param    mode This parameter can be one of the following values:
    *           @arg @ref FL_DMA_MEMORY_INC_MODE_NOCHANGE
    *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
    *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
    * @param    channel This parameter can be one of the following values:
    *           @arg @ref FL_DMA_CHANNEL_0
    *           @arg @ref FL_DMA_CHANNEL_1
    *           @arg @ref FL_DMA_CHANNEL_2
    *           @arg @ref FL_DMA_CHANNEL_3
    * @retval   None
    */
  __STATIC_INLINE void FL_DMA_SetMemoryIncrementMode(DMA_Type *DMAx, uint32_t mode, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CHCR, (0x3U << 6U), mode);
    }
  }

  /**
   * @brief    Get channelx RAM address incremental status
   * @rmtoll   CHCR    MINC    FL_DMA_GetRamIncrementMode
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_MEMORY_INC_MODE_NOCHANGE
   *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
   *           @arg @ref FL_DMA_MEMORY_INC_MODE_INCREASE
   */
  __STATIC_INLINE uint32_t FL_DMA_GetRamIncrementMode(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, (0x3U << 6U)) >> 6U);
    }
    return 0;
  }

  /**
    * @brief    Set channelx Peripheral address incremental
    * @rmtoll   CHCR    PINC    FL_DMA_SetPeripheralIncrementMode

    * @param    DMAx DMA instance
    * @param    mode This parameter can be one of the following values:
    *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_NOCHANGE
    *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_INCREASE
    *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_DECREASE
    * @param    channel This parameter can be one of the following values:
    *           @arg @ref FL_DMA_CHANNEL_0
    *           @arg @ref FL_DMA_CHANNEL_1
    *           @arg @ref FL_DMA_CHANNEL_2
    *           @arg @ref FL_DMA_CHANNEL_3
    * @retval   None
    */
  __STATIC_INLINE void FL_DMA_SetPeripheralIncrementMode(DMA_Type *DMAx, uint32_t mode, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CHCR, (0x3U << 4U), mode);
    }
  }

  /**
   * @brief    Get channelx Peripheral address incremental status
   * @rmtoll   CHCR    PINC    FL_DMA_GetPeripheralIncrementMode
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_NOCHANGE
   *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_INCREASE
   *           @arg @ref FL_DMA_PERIPHERAL_INC_MODE_DECREASE
   */
  __STATIC_INLINE uint32_t FL_DMA_GetPeripheralIncrementMode(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, (0x3U << 4U)) >> 4U);
    }
    return 0;
  }

  /**
   * @brief    DMA Double Buffering enable
   * @rmtoll   CHCR    DBUF    FL_DMA_EnableDoubleBuffering
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableDoubleBuffering(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      SET_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_DBUF_Msk);
    }
  }

  /**
   * @brief    Get DMA Double Buffering enable status
   * @rmtoll   CHCR    DBUF    FL_DMA_IsEnabledDoubleBuffering
   * @param    DMAx DMA instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledDoubleBuffering(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_DBUF_Msk) == DMA_CHCR_DBUF_Msk);
    }
    return 0;
  }

  /**
   * @brief    DMA Double Buffering disable
   * @rmtoll   CHCR    DBUF    FL_DMA_DisableDoubleBuffering
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableDoubleBuffering(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      CLEAR_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_DBUF_Msk);
    }
  }

  /**
   * @brief    Channelx enable
   * @rmtoll   CHCR    EN    FL_DMA_EnableChannel
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableChannel(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      SET_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_EN_Msk);
    }
    else
    {
      SET_BIT(Temp->CH7CR, DMA_CHCR_EN_Msk);
    }
  }

  /**
   * @brief    Get channelx enable status
   * @rmtoll   CHCR    EN    FL_DMA_IsEnabledChannel
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledChannel(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_EN_Msk) == DMA_CHCR_EN_Msk);
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CHCR_EN_Msk) == DMA_CHCR_EN_Msk);
    }
  }

  /**
   * @brief    Channelx disable
   * @rmtoll   CHCR    EN    FL_DMA_DisableChannel
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableChannel(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      CLEAR_BIT(Temp->Channel[channel].CHCR, DMA_CHCR_EN_Msk);
    }
    else
    {
      CLEAR_BIT(Temp->CH7CR, DMA_CHCR_EN_Msk);
    }
  }

  /**
   * @brief    Set channelx transmission length
   * @rmtoll   CFGR    TSIZE    FL_DMA_WriteTransmissionSize
   * @param    DMAx DMA instance
   * @param    size
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_WriteTransmissionSize(DMA_Type *DMAx, uint32_t size, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CFGR, (0xffffU << 16U), (size << 16U));
    }
    else
    {
      MODIFY_REG(Temp->CH7CR, (0x1fffU << 16U), (size << 16U));
    }
  }

  /**
   * @brief    Get channelx transmission length
   * @rmtoll   CFGR    TSIZE    FL_DMA_ReadTransmissionSize
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval
   */
  __STATIC_INLINE uint32_t FL_DMA_ReadTransmissionSize(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, (0xffffU << 16U)) >> 16U);
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7CR, (0x1fffU << 16U)) >> 16U);
    }
  }

  /**
   * @brief    Channelx Suspend enable
   * @rmtoll   CFGR    SUSP    FL_DMA_EnableChannelSuspend
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableChannelSuspend(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      SET_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_SUSP_Msk);
    }
  }

  /**
   * @brief    Get channelx Suspend enable status
   * @rmtoll   CFGR    SUSP    FL_DMA_IsEnabledChannelSuspend
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledChannelSuspend(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_SUSP_Msk) == DMA_CFGR_SUSP_Msk);
    }
    return 0;
  }

  /**
   * @brief    Channelx Suspend disable
   * @rmtoll   CFGR    SUSP    FL_DMA_DisableChannelSuspend
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableChannelSuspend(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      CLEAR_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_SUSP_Msk);
    }
  }

  /**
   * @brief    Channelx request source select
   * @rmtoll   CFGR    RSEL    FL_DMA_SetPeripheralMap
   * @param    DMAx DMA instance
   * @param    peripheral This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_SPI0_RX
   *           @arg @ref FL_DMA_CHANNEL_SPI1_RX
   *           @arg @ref FL_DMA_CHANNEL_SPI2_RX
   *           @arg @ref FL_DMA_CHANNEL_SPI0_TX
   *           @arg @ref FL_DMA_CHANNEL_SPI1_TX
   *           @arg @ref FL_DMA_CHANNEL_SPI2_TX
   *           @arg @ref FL_DMA_CHANNEL_UART0_RX
   *           @arg @ref FL_DMA_CHANNEL_UART1_RX
   *           @arg @ref FL_DMA_CHANNEL_UART2_RX
   *           @arg @ref FL_DMA_CHANNEL_UART3_RX
   *           @arg @ref FL_DMA_CHANNEL_UART4_RX
   *           @arg @ref FL_DMA_CHANNEL_UART5_RX
   *           @arg @ref FL_DMA_CHANNEL_UART6_RX
   *           @arg @ref FL_DMA_CHANNEL_UART7_RX
   *           @arg @ref FL_DMA_CHANNEL_UART0_TX
   *           @arg @ref FL_DMA_CHANNEL_UART1_TX
   *           @arg @ref FL_DMA_CHANNEL_UART2_TX
   *           @arg @ref FL_DMA_CHANNEL_UART3_TX
   *           @arg @ref FL_DMA_CHANNEL_UART4_TX
   *           @arg @ref FL_DMA_CHANNEL_UART5_TX
   *           @arg @ref FL_DMA_CHANNEL_UART6_TX
   *           @arg @ref FL_DMA_CHANNEL_UART7_TX
   *           @arg @ref FL_DMA_CHANNEL_LPUART0_RX
   *           @arg @ref FL_DMA_CHANNEL_LPUART0_TX
   *           @arg @ref FL_DMA_CHANNEL_CRC
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH1
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH2
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH3
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH4
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_TRIG
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_COM
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_UEV
   *           @arg @ref FL_DMA_CHANNEL_TAU00
   *           @arg @ref FL_DMA_CHANNEL_TAU01
   *           @arg @ref FL_DMA_CHANNEL_TAU02
   *           @arg @ref FL_DMA_CHANNEL_TAU03
   *           @arg @ref FL_DMA_CHANNEL_TAU04
   *           @arg @ref FL_DMA_CHANNEL_TAU05
   *           @arg @ref FL_DMA_CHANNEL_TAU06
   *           @arg @ref FL_DMA_CHANNEL_TAU07
   *           @arg @ref FL_DMA_CHANNEL_TAU10
   *           @arg @ref FL_DMA_CHANNEL_TAU11
   *           @arg @ref FL_DMA_CHANNEL_TAU12
   *           @arg @ref FL_DMA_CHANNEL_TAU13
   *           @arg @ref FL_DMA_CHANNEL_TAU14
   *           @arg @ref FL_DMA_CHANNEL_TAU15
   *           @arg @ref FL_DMA_CHANNEL_TAU16
   *           @arg @ref FL_DMA_CHANNEL_TAU17
   *           @arg @ref FL_DMA_CHANNEL_BSTIM0_TRI
   *           @arg @ref FL_DMA_CHANNEL_LPTIM0_TRI
   *           @arg @ref FL_DMA_CHANNEL_DAC
   *           @arg @ref FL_DMA_CHANNEL_SWTRIG
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_SetPeripheralMap(DMA_Type *DMAx, uint32_t peripheral, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CFGR, DMA_CFGR_RSEL_Msk, peripheral << 8);
    }
  }

