Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_dma.h
  /**
   * @brief    Get Channelx request source select status
   * @rmtoll   CFGR    RSEL    FL_DMA_GetPeripheralMap
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_SPI0_RX
   *           @arg @ref FL_DMA_CHANNEL_SPI1_RX
   *           @arg @ref FL_DMA_CHANNEL_SPI2_RX
   *           @arg @ref FL_DMA_CHANNEL_SPI0_TX
   *           @arg @ref FL_DMA_CHANNEL_SPI1_TX
   *           @arg @ref FL_DMA_CHANNEL_SPI2_TX
   *           @arg @ref FL_DMA_CHANNEL_UART0_RX
   *           @arg @ref FL_DMA_CHANNEL_UART1_RX
   *           @arg @ref FL_DMA_CHANNEL_UART2_RX
   *           @arg @ref FL_DMA_CHANNEL_UART3_RX
   *           @arg @ref FL_DMA_CHANNEL_UART4_RX
   *           @arg @ref FL_DMA_CHANNEL_UART5_RX
   *           @arg @ref FL_DMA_CHANNEL_UART6_RX
   *           @arg @ref FL_DMA_CHANNEL_UART7_RX
   *           @arg @ref FL_DMA_CHANNEL_UART0_TX
   *           @arg @ref FL_DMA_CHANNEL_UART1_TX
   *           @arg @ref FL_DMA_CHANNEL_UART2_TX
   *           @arg @ref FL_DMA_CHANNEL_UART3_TX
   *           @arg @ref FL_DMA_CHANNEL_UART4_TX
   *           @arg @ref FL_DMA_CHANNEL_UART5_TX
   *           @arg @ref FL_DMA_CHANNEL_UART6_TX
   *           @arg @ref FL_DMA_CHANNEL_UART7_TX
   *           @arg @ref FL_DMA_CHANNEL_LPUART0_RX
   *           @arg @ref FL_DMA_CHANNEL_LPUART0_TX
   *           @arg @ref FL_DMA_CHANNEL_CRC
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH1
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH2
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH3
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_CH4
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_TRIG
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_COM
   *           @arg @ref FL_DMA_CHANNEL_ATIM0_UEV
   *           @arg @ref FL_DMA_CHANNEL_TAU00
   *           @arg @ref FL_DMA_CHANNEL_TAU01
   *           @arg @ref FL_DMA_CHANNEL_TAU02
   *           @arg @ref FL_DMA_CHANNEL_TAU03
   *           @arg @ref FL_DMA_CHANNEL_TAU04
   *           @arg @ref FL_DMA_CHANNEL_TAU05
   *           @arg @ref FL_DMA_CHANNEL_TAU06
   *           @arg @ref FL_DMA_CHANNEL_TAU07
   *           @arg @ref FL_DMA_CHANNEL_TAU10
   *           @arg @ref FL_DMA_CHANNEL_TAU11
   *           @arg @ref FL_DMA_CHANNEL_TAU12
   *           @arg @ref FL_DMA_CHANNEL_TAU13
   *           @arg @ref FL_DMA_CHANNEL_TAU14
   *           @arg @ref FL_DMA_CHANNEL_TAU15
   *           @arg @ref FL_DMA_CHANNEL_TAU16
   *           @arg @ref FL_DMA_CHANNEL_TAU17
   *           @arg @ref FL_DMA_CHANNEL_BSTIM0_TRI
   *           @arg @ref FL_DMA_CHANNEL_LPTIM0_TRI
   *           @arg @ref FL_DMA_CHANNEL_DAC
   *           @arg @ref FL_DMA_CHANNEL_SWTRIG
   */
  __STATIC_INLINE uint32_t FL_DMA_GetPeripheralMap(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, (0x7fU << 8U)) >> 8U);
    }
    return 0;
  }

  /**
   * @brief    Set channelx priority
   * @rmtoll   CFGR    PRI    FL_DMA_SetPriority
   * @param    DMAx DMA instance
   * @param    priority This parameter can be one of the following values:
   *           @arg @ref FL_DMA_PRIORITY_LOW
   *           @arg @ref FL_DMA_PRIORITY_MEDIUM
   *           @arg @ref FL_DMA_PRIORITY_HIGH
   *           @arg @ref FL_DMA_PRIORITY_VERYHIGH
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_SetPriority(DMA_Type *DMAx, uint32_t priority, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CFGR, DMA_CFGR_PRI_Msk, priority << 6);
    }
    else
    {
      MODIFY_REG(Temp->CH7CR, DMA_CH7CR_PRI_Msk, priority << 12);
    }
  }

  /**
   * @brief    Get channelx priority
   * @rmtoll   CFGR    PRI    FL_DMA_GetPriority
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_PRIORITY_LOW
   *           @arg @ref FL_DMA_PRIORITY_MEDIUM
   *           @arg @ref FL_DMA_PRIORITY_HIGH
   *           @arg @ref FL_DMA_PRIORITY_VERYHIGH
   */
  __STATIC_INLINE uint32_t FL_DMA_GetPriority(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_PRI_Msk) >> DMA_CFGR_PRI_Pos);
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CH7CR_PRI_Msk) >> DMA_CH7CR_PRI_Pos);
    }
  }

  /**
   * @brief    Set transmit bandwidth
   * @rmtoll   CFGR    BDW    FL_DMA_SetBandwidth
   * @param    DMAx DMA instance
   * @param    bandwidth This parameter can be one of the following values:
   *           @arg @ref FL_DMA_BANDWIDTH_8B
   *           @arg @ref FL_DMA_BANDWIDTH_16B
   *           @arg @ref FL_DMA_BANDWIDTH_32B
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_SetBandwidth(DMA_Type *DMAx, uint32_t bandwidth, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CFGR, DMA_CFGR_BDW_Msk, bandwidth);
    }
  }

  /**
   * @brief    Get transmit bandwidth
   * @rmtoll   CFGR    BDW    FL_DMA_GetBandwidth
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_BANDWIDTH_8B
   *           @arg @ref FL_DMA_BANDWIDTH_16B
   *           @arg @ref FL_DMA_BANDWIDTH_32B
   */
  __STATIC_INLINE uint32_t FL_DMA_GetBandwidth(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_BDW_Msk));
    }
    else
    {
      /* FLASH 通道 默认位宽32Bit */
      return FL_DMA_BANDWIDTH_32B;
    }
  }

  /**
   * @brief    Circular mode enable
   * @rmtoll   CFGR    CIRC    FL_DMA_EnableCircularMode
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableCircularMode(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      SET_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_CIRC_Msk);
    }
  }

  /**
   * @brief    Get circular mode enable status
   * @rmtoll   CFGR    CIRC    FL_DMA_IsEnabledCircularMode
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledCircularMode(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_CIRC_Msk) == DMA_CFGR_CIRC_Msk);
    }
    return 0;
  }

  /**
   * @brief    Circular mode disable
   * @rmtoll   CFGR    CIRC    FL_DMA_DisableCircularMode
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableCircularMode(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      CLEAR_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_CIRC_Msk);
    }
  }

  /**
   * @brief    channelx transmit finished interrupt enable
   * @rmtoll   CFGR    FTIE    FL_DMA_EnableIT_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableIT_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      SET_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_FTIE_Msk);
    }
    else
    {
      SET_BIT(Temp->CH7CR, DMA_CFGR_FTIE_Msk);
    }
  }

  /**
   * @brief    Get channelx transmit finished interrupt enable status
   * @rmtoll   CFGR    FTIE    FL_DMA_IsEnabledIT_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledIT_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_FTIE_Msk) == DMA_CFGR_FTIE_Msk);
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CFGR_FTIE_Msk) == DMA_CFGR_FTIE_Msk);
    }
  }

  /**
   * @brief    channelx transmit finished interrupt disable
   * @rmtoll   CFGR    FTIE    FL_DMA_DisableIT_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableIT_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      CLEAR_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_FTIE_Msk);
    }
    else
    {
      CLEAR_BIT(Temp->CH7CR, DMA_CFGR_FTIE_Msk);
    }
  }

  /**
   * @brief    Channelx Half-transfer interrupt enable
   * @rmtoll   CFGR    HTIE    FL_DMA_EnableIT_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableIT_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      SET_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_HTIE_Msk);
    }
    else
    {
      SET_BIT(Temp->CH7CR, DMA_CFGR_HTIE_Msk);
    }
  }

  /**
   * @brief    Get Channelx Half-transfer interrupt enable status
   * @rmtoll   CFGR    HTIE    FL_DMA_IsEnabledIT_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledIT_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_HTIE_Msk) == DMA_CFGR_HTIE_Msk);
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CFGR_HTIE_Msk) == DMA_CFGR_HTIE_Msk);
    }
  }

  /**
   * @brief    Channelx Half-transfer interrupt disable
   * @rmtoll   CFGR    HTIE    FL_DMA_DisableIT_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableIT_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      CLEAR_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_HTIE_Msk);
    }
    else
    {
      CLEAR_BIT(Temp->CH7CR, DMA_CFGR_HTIE_Msk);
    }
  }

  /**
   * @brief    Set channelx transmit direction
   * @rmtoll   CFGR    DIR    FL_DMA_SetTransmissionDirection
   * @param    DMAx DMA instance
   * @param    direction This parameter can be one of the following values:
   *           @arg @ref FL_DMA_DIR_PERIPHERAL_TO_RAM
   *           @arg @ref FL_DMA_DIR_RAM_TO_PERIPHERAL
   *           @arg @ref FL_DMA_DIR_FLASH_TO_RAM
   *           @arg @ref FL_DMA_DIR_RAM_TO_FLASH
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_SetTransmissionDirection(DMA_Type *DMAx, uint32_t direction, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CFGR, DMA_CFGR_DIR_Msk, direction);
    }
    else
    {
      MODIFY_REG(Temp->CH7CR, DMA_CH7CR_DIR_Msk, direction);
    }
  }

  /**
   * @brief    Get channelx transmit direction
   * @rmtoll   CFGR    DIR    FL_DMA_GetTransmissionDirection
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_DIR_PERIPHERAL_TO_RAM
   *           @arg @ref FL_DMA_DIR_RAM_TO_PERIPHERAL
   *           @arg @ref FL_DMA_DIR_FLASH_TO_RAM
   *           @arg @ref FL_DMA_DIR_RAM_TO_FLASH
   */
  __STATIC_INLINE uint32_t FL_DMA_GetTransmissionDirection(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CFGR, DMA_CFGR_DIR_Msk));
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7CR, DMA_CH7CR_DIR_Msk));
    }
  }

  /**
   * @brief    Set channelx Peripheral pointer address
   * @rmtoll   PAR        FL_DMA_WritePeripheralAddress
   * @param    DMAx DMA instance
   * @param    data
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_WritePeripheralAddress(DMA_Type *DMAx, uint32_t data, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].PAR, (0xffffffffU), (data));
    }
    else
    {
      MODIFY_REG(Temp->CH7FLSAD, (0xfffffffU), (data));
    }
  }

  /**
   * @brief    Get channelx Peripheral pointer address
   * @rmtoll   PAR        FL_DMA_ReadPeripheralAddress
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval
   */
  __STATIC_INLINE uint32_t FL_DMA_ReadPeripheralAddress(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].PAR, (0xffffffffU)));
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7FLSAD, (0xfffffffU)));
    }
  }

  /**
   * @brief    Set channelx memory0 pointer address
   * @rmtoll   MEMAD0        FL_DMA_WriteMemoryAddress0
   * @param    DMAx DMA instance
   * @param    data
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_WriteMemoryAddress0(DMA_Type *DMAx, uint32_t data, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CHMAD0, (0xffffffffU), (data));
    }
    else
    {
      MODIFY_REG(Temp->CH7MAD, (0xffffffU), (data));
    }
  }

  /**
   * @brief    Get channelx memory0 pointer address
   * @rmtoll   MEMAD0        FL_DMA_ReadMemoryAddress
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval
   */
  __STATIC_INLINE uint32_t FL_DMA_ReadMemoryAddress(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CHMAD0, (0xffffffffU)));
    }
    else
    {
      return (uint32_t)(READ_BIT(Temp->CH7MAD, (0xffffffU)));
    }
  }

  /**
   * @brief    Set channelx memory1 pointer address
   * @rmtoll   MEMAD1        FL_DMA_WriteMemoryAddress1
   * @param    DMAx DMA instance
   * @param    data
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_WriteMemoryAddress1(DMA_Type *DMAx, uint32_t data, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      MODIFY_REG(Temp->Channel[channel].CHMAD1, (0xffffffffU), (data));
    }
  }

  /**
   * @brief    Get channelx memory1 pointer address
   * @rmtoll   MEMAD1        FL_DMA_ReadMemoryAddress1
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval
   */
  __STATIC_INLINE uint32_t FL_DMA_ReadMemoryAddress1(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->Channel[channel].CHMAD1, (0xffffffffU)));
    }
    return 0;
  }

  /**
   * @brief    Set channel7 flash object address type
   * @rmtoll   CH7FLSAD    DFLS    FL_DMA_SetFlashAddressType
   * @param    DMAx DMA instance
   * @param    type This parameter can be one of the following values:
   *           @arg @ref FL_DMA_FLASH_CODE
   *           @arg @ref FL_DMA_FLASH_DATA
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_SetFlashAddressType(DMA_Type *DMAx, uint32_t type)
  {
    MODIFY_REG(DMAx->CH7FLSAR, DMA_CH7FLSAD_DFLS_Msk, type);
  }

  /**
   * @brief    Get channel7 flash object address type
   * @rmtoll   CH7FLSAD    DFLS    FL_DMA_GetFlashAddressType
   * @param    DMAx DMA instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_FLASH_CODE
   *           @arg @ref FL_DMA_FLASH_DATA
   */
  __STATIC_INLINE uint32_t FL_DMA_GetFlashAddressType(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->CH7FLSAR, DMA_CH7FLSAD_DFLS_Msk));
  }

  /**
    * @brief    Set Flash channel RAM address incremental
    * @rmtoll   CH7CR    RINC    FL_DMA_SetFlashMemoryIncrementMode

    * @param    DMAx DMA instance
    * @param    mode This parameter can be one of the following values:
    *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_INCREASE
    *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_DECREASE
    * @retval   None
    */
  __STATIC_INLINE void FL_DMA_SetFlashMemoryIncrementMode(DMA_Type *DMAx, uint32_t mode)
  {
    MODIFY_REG(DMAx->CH7CR, DMA_CH7CR_RINC_Msk, mode);
  }

  /**
   * @brief    Get  Flash channel RAM address incremental status
   * @rmtoll   CH7CR    RINC    FL_DMA_GetFlashRamIncrementMode
   * @param    DMAx DMA instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_INCREASE
   *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_DECREASE
   */
  __STATIC_INLINE uint32_t FL_DMA_GetFlashRamIncrementMode(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->CH7CR, DMA_CH7CR_RINC_Msk) == DMA_CH7CR_RINC_Msk);
  }

