Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_dma.h
  /**
   * @brief    Get  Flash channel RAM address incremental status
   * @rmtoll   CH7CR    FINC    FL_DMA_GetFlashAddrIncremental
   * @param    DMAx DMA instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_INCREASE
   *           @arg @ref FL_DMA_CH7_RAM_INC_MODE_DECREASE
   */
  __STATIC_INLINE uint32_t FL_DMA_GetFlashAddrIncremental(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->CH7CR, DMA_CH7CR_FINC_Msk) == DMA_CH7CR_FINC_Msk);
  }

  /**
    * @brief    Set Flash channel RAM address incremental
    * @rmtoll   CH7CR    FINC    FL_DMA_SetFlashAddrIncremental

    * @param    DMAx DMA instance
    * @param    mode This parameter can be one of the following values:
    *           @arg @ref FL_DMA_CH7_FLASH_INC_MODE_INCREASE
    *           @arg @ref FL_DMA_CH7_FLASH_INC_MODE_DECREASE
    * @retval   None
    */
  __STATIC_INLINE void FL_DMA_SetFlashAddrIncremental(DMA_Type *DMAx, uint32_t mode)
  {
    MODIFY_REG(DMAx->CH7CR, DMA_CH7CR_FINC_Msk, mode);
  }

  /**
   * @brief    DMA address error interrupt enable
   * @rmtoll   GCR    ADDRERR_IE    FL_DMA_EnableIT_AddressError
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_EnableIT_AddressError(DMA_Type *DMAx)
  {
    SET_BIT(DMAx->GCR, DMA_GCR_ADDRERR_IE_Msk);
  }

  /**
   * @brief    Get DMA address error interrupt enable status
   * @rmtoll   GCR    ADDRERR_IE    FL_DMA_IsEnabledIT_AddressError
   * @param    DMAx DMA instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabledIT_AddressError(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->GCR, DMA_GCR_ADDRERR_IE_Msk) == DMA_GCR_ADDRERR_IE_Msk);
  }

  /**
   * @brief    DMA address error interrupt disable
   * @rmtoll   GCR    ADDRERR_IE    FL_DMA_DisableIT_AddressError
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_DisableIT_AddressError(DMA_Type *DMAx)
  {
    CLEAR_BIT(DMAx->GCR, DMA_GCR_ADDRERR_IE_Msk);
  }

  /**
   * @brief    DMA enable
   * @rmtoll   GCR    EN    FL_DMA_Enable
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_Enable(DMA_Type *DMAx)
  {
    SET_BIT(DMAx->GCR, DMA_GCR_EN_Msk);
  }

  /**
   * @brief    Get DMA enable status
   * @rmtoll   GCR    EN    FL_DMA_IsEnabled
   * @param    DMAx DMA instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsEnabled(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->GCR, DMA_GCR_EN_Msk) == DMA_GCR_EN_Msk);
  }

  /**
   * @brief    DMA disable
   * @rmtoll   GCR    EN    FL_DMA_Disable
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_Disable(DMA_Type *DMAx)
  {
    CLEAR_BIT(DMAx->GCR, DMA_GCR_EN_Msk);
  }

  /**
    * @brief    Set channelx soft trigger
    * @rmtoll   SWRR      SWTRING     FL_DMA_SetChannelxSoftTrigger
    * @param    DMAx DMA instance
    * @param    data This parameter can be one of the following values:
    *           @arg @ref FL_DMA_TRIGGER_CHANNEL_0
    *           @arg @ref FL_DMA_TRIGGER_CHANNEL_1
    * @param    channel This parameter can be one of the following values:
    *           @arg @ref FL_DMA_CHANNEL_0
    *           @arg @ref FL_DMA_CHANNEL_1

    * @retval   None
    */
  __STATIC_INLINE void FL_DMA_SetChannelxSoftTrigger(DMA_Type *DMAx, uint32_t data, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_1)
    {
      MODIFY_REG(Temp->SWRR, (0x3fU), (data));
    }
  }

  /**
   * @brief    Get channelx soft trigger status
   * @rmtoll   SWRR      SWTRING     FL_DMA_GetChannelxSoftTrigger
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_DMA_TRIGGER_CHANNEL_0
   *           @arg @ref FL_DMA_TRIGGER_CHANNEL_1
   */
  __STATIC_INLINE uint32_t FL_DMA_GetChannelxSoftTrigger(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_1)
    {
      return (uint32_t)(READ_BIT(Temp->SWRR, (0x3fU)));
    }
    return 0;
  }

  /**
   * @brief    Get DMA address error flag
   * @rmtoll   ISR    ADDRERR    FL_DMA_IsActiveFlag_AddressError
   * @param    DMAx DMA instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsActiveFlag_AddressError(DMA_Type *DMAx)
  {
    return (uint32_t)(READ_BIT(DMAx->ISR, DMA_ISR_ADDRERR_Msk) == (DMA_ISR_ADDRERR_Msk));
  }

  /**
   * @brief    Clear DMA address error flag
   * @rmtoll   ISR    ADDRERR    FL_DMA_ClearFlag_AddressError
   * @param    DMAx DMA instance
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_ClearFlag_AddressError(DMA_Type *DMAx)
  {
    WRITE_REG(DMAx->ISR, DMA_ISR_ADDRERR_Msk);
  }

  /**
   * @brief    Get DMA channelx finished-transfer flag
   * @rmtoll   ISR    CHFT    FL_DMA_IsActiveFlag_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsActiveFlag_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(DMAx->ISR, ((0x1U << channel) << DMA_ISR_CHFT_Pos)) == ((0x1U << channel) << DMA_ISR_CHFT_Pos));
  }

  /**
   * @brief    Clear DMA channelx finished-transfer flag
   * @rmtoll   ISR    CHFT    FL_DMA_ClearFlag_TransferComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_ClearFlag_TransferComplete(DMA_Type *DMAx, uint32_t channel)
  {
    WRITE_REG(DMAx->ISR, (DMA_ISR_CHFT_Msk << channel));
  }

  /**
   * @brief    Get DMA channel half-transfer flag
   * @rmtoll   ISR    CHHT    FL_DMA_IsActiveFlag_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_DMA_IsActiveFlag_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(DMAx->ISR, ((0x1U << channel) << DMA_ISR_CHHT_Pos)) == ((0x1U << channel) << DMA_ISR_CHHT_Pos));
  }

  /**
   * @brief    Clear DMA channel half-transfer flag
   * @rmtoll   ISR    CHHT    FL_DMA_ClearFlag_TransferHalfComplete
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   *           @arg @ref FL_DMA_CHANNEL_7
   * @retval   None
   */
  __STATIC_INLINE void FL_DMA_ClearFlag_TransferHalfComplete(DMA_Type *DMAx, uint32_t channel)
  {
    WRITE_REG(DMAx->ISR, (DMA_ISR_CHHT_Msk << channel));
  }

  /**
   * @brief    Get channelx transfer remainder length
   * @rmtoll   TFSIZE_CNT        FL_DMA_ReadPeripheralTransferRemainderLength
   * @param    DMAx DMA instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_DMA_CHANNEL_0
   *           @arg @ref FL_DMA_CHANNEL_1
   *           @arg @ref FL_DMA_CHANNEL_2
   *           @arg @ref FL_DMA_CHANNEL_3
   * @retval
   */
  __STATIC_INLINE uint32_t FL_DMA_ReadPeripheralTransferRemainderLength(DMA_Type *DMAx, uint32_t channel)
  {
    DMA_ADDR *Temp = (DMA_ADDR *)DMAx;
    if (channel <= FL_DMA_CHANNEL_3)
    {
      return (uint32_t)(READ_BIT(Temp->TFSADDR[channel], (0xffffU)));
    }
    return 0;
  }

  /**
   * @}
   */

  /** @defgroup DMA_FL_EF_Init Initialization and de-initialization functions
   * @{
   */
  FL_ErrorStatus FL_DMA_DeInit(DMA_Type *DMAx);
  FL_ErrorStatus FL_DMA_Init(DMA_Type *DMAx, FL_DMA_InitTypeDef *initStruct, uint32_t channel);
  void FL_DMA_StructInit(FL_DMA_InitTypeDef *InitStruct);

  FL_ErrorStatus FL_DMA_StartTransmission(DMA_Type *DMAx, FL_DMA_ConfigTypeDef *configStruct, uint32_t channel);

  /**
   * @}
   */

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif

#endif /* __FM33HT0XXA_FL_DMA_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-06-08*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
